import logging,os
from functools import wraps
from datetime import datetime


def init_logging(islog=False,logpath='LOG'):
    text = """
    本目录是用来存放pytasknium的log,请勿随意删除!
    """
    try:
        if (logpath != 'LOG'):
            logpath = str(logpath).strip()
            logpath = logpath.rstrip("\\")

    except Exception as e:
        logpath='LOG'


    isExists = os.path.exists(logpath)
    if not isExists:
        os.makedirs(logpath)

    if(not os.path.exists(logpath+"\\readme.txt")):
        with open(logpath + "\\readme.txt", "w+") as f:
            f.write(text)
    formatter = '[%(asctime)s] [%(levelname)s]: %(message)s'
    if islog:
        logging.basicConfig(level=logging.INFO, format=formatter)
        filelog = logging.FileHandler(filename=logpath + "\\%s.log" % datetime.now().strftime("%H%M%S"),
                                      mode="a", encoding="utf-8")
        filelog.setLevel(logging.INFO)
        filelog.setFormatter(logging.Formatter(formatter, "%H:%M:%S"))
        logging.getLogger('').addHandler(filelog)
        hostlog(logging.getLogger('').handlers)
    else:
        logging.basicConfig(level=logging.INFO, format=formatter)

    return logpath+"\\"




def init_png(pngpath='TMP'):
    text = """
    本目录是用来存放pytasknium所截图的文件,请勿随意删除!
    """
    try:
        if (pngpath != 'TMP'):
            pngpath = str(pngpath).strip()
            pngpath = pngpath.rstrip("\\")
    except Exception as e:
        pngpath="TMP"

    isExists = os.path.exists(pngpath)
    if not isExists:
        os.makedirs(pngpath)


    if(not os.path.exists(pngpath+ "\\readme.txt")):
        with open(pngpath + "\\readme.txt", "w+") as f:
            f.write(text)


    return pngpath+"\\"


def logginginfo(str=None):
    logging.info(str)


def loggingerror(str=None, e=None):
    logging.warning(e)
    logging.warning(str)


def hostlog(arg, *args):
    for value in arg:
        print(value,end="")





def logs(func):
    def func_in(*args,**kwargs):
        reslut = None
        try:
            reslut = func(*args, **kwargs)
            # logginginfo(func.__name__ + " is succeed")
        except Exception as e:
            loggingerror(e,func.__name__ + " is error")
        finally:
            return reslut
    return func_in


def log_time_delta(func):
    @wraps(func)
    def deco(*args,**kwargs):
        start = datetime.now()
        res = func(*args,**kwargs)
        end = datetime.now()
        delta = end - start
        print(func.__name__ +" time is ", delta)
        return res
    return deco



random_keyword_list=["女连衣裙", "女装连衣裙", "连衣裙", "女雪纺衫", "大码女装", "女t恤", "手机", "女包", "女单鞋", "女衬衫", "女凉鞋", "男t恤", "连衣裙女", "凉鞋", "连衣裙 女",
         "雪纺衫 女", "新款连衣裙", "女鞋", "打底裤", "t恤", "春装连衣裙", "运动套装", "女西装", "红米", "风衣", "中老年女装", "半身裙", "男鞋", "雪纺衫", "帆布鞋",
         "春单鞋女", "雪纺衫女", "雪纺上衣", "童装", "孕妇装", "单鞋", "女鞋单鞋", "小西装", "衬衫 女", "蚊帐", "短袖女t恤", "长袖女衬衫", "情侣装", "长袖女t恤",
         "高跟鞋", "休闲套装", "女装雪纺衫", "单鞋女", "小西装 女", "雪纺连衣裙", "长裙", "婚纱", "短裙", "女短外套", "长裙 连衣裙", "童装", "女长袖连衣裙", "短外套",
         "t恤女", "小米3", "蕾丝衫", "女装", "智能手机", "女针织衫", "男装衬衫", "妈妈装", "短袖 女", "女风衣", "夏装女连衣裙", "女凉拖", "孕妇连衣裙", "大码女装春装",
         "女牛仔裤", "雪纺女裙", "摩托车", "女装t恤", "平板电脑", "男包", "连衣裙夏", "平跟", "凉鞋 女", "防晒衣", "打底衫", "女装打底衫", "加大码", "套装", "旗袍",
         "套装 女", "坡跟单鞋", "文胸", "鱼竿", "衬衫", "半身长裙", "中跟", "男衬衫", "哈伦裤女休闲", "男装休闲裤", "哈伦裤 女", "吊带背心", "女背心", "短袖女雪纺衫",
         "亲子装", "充电宝", "女短裤", "连衣裙长袖", "开衫", "女连衣裙夏装", "牛仔外套", "长袖男t恤", "t恤男短袖", "鱼嘴鞋凉鞋", "男装夹克", "十字绣", "电动车", "鱼嘴鞋",
         "女装 连衣裙", "短外套女春", "情侣装 夏", "外贸大码女装", "牛仔裤 女", "女装衬衫", "女装", "开衫 女", "连体裤", "坡跟凉鞋", "三星", "女裤", "女单肩包", "高跟",
         "钓鱼竿", "情趣内衣", "豆豆鞋 女", "凉鞋女", "红米note", "移动电源", "低帮鞋", "西装 女", "柠檬杯", "牛仔裤 男", "针织衫", "女半身裙", "孕妇裤", "红米手机",
         "连衣裙女装", "女针织开衫", "运动套装", "女手提包", "情侣装夏", "男帆布鞋", "外套 女", "手表", "小米手机", "女童凉鞋", "短袖女连衣裙", "四件套", "蕾丝连衣裙",
         "牛仔外套女", "女士衬衫", "男T恤", "鞋柜", "小米", "平底鞋", "女装雪纺裙", "欧根纱连衣裙", "女童裙装", "防水台 单鞋", "短裤女", "真皮女包", "短裤", "窗帘",
         "男装牛仔裤", "女斜挎包", "女大码女装", "蕾丝打底衫", "沙发垫", "女雪纺连衣裙", "女鞋 凉鞋", "单鞋 水钻", "面条机", "衬衫女长袖", "拖鞋", "女式风衣", "男凉鞋",
         "笔记本电脑", "小外套", "卫衣 女", "孕妇裙", "中老年", "男短袖", "吊带小背心", "女春装外套", "雪纺", "连衣裙 夏", "手链", "床上用品", "女装打底裤", "女长裙连衣裙",
         "女尖头鞋", "面膜", "风衣女", "男装t恤", "韩国连衣裙", "牛仔连衣裙", "女打底裤", "西装女", "花盆", "收纳箱", "女春装外套", "小西装女外套", "包袋", "女睡衣",
         "自行车", "女休闲套装", "针织开衫", "衬衫女", "男休闲裤", "男士衬衫", "豆豆鞋 男", "韩版连衣裙", "运动鞋", "多肉植物", "休闲裤", "休闲鞋", "项链", "男钱包",
         "T恤女", "九分裤", "跑步鞋", "哈伦裤", "女帆布鞋", "男休闲鞋", "女童连衣裙", "西装", "电脑桌", "三口亲子装", "女春装外套", "休闲裤", "外穿打底裤", "红米NOTE",
         "双肩包", "儿童电动车", "孕妇打底裤", "夏装连衣裙", "童装 女童", "印花裙", "女士西装", "男士短袖", "电信手机", "豆豆鞋女鞋", "女装皮衣", "高跟凉鞋", "拖鞋",
         "拖鞋 女", "吸顶灯", "无线路由器", "潮流女包", "西装外套 女", "蓝牙耳机", "女装", "连衣裙 夏季", "长裙", "山地自行车", "女松糕鞋", "坡跟女凉鞋", "宽松女t恤",
         "男外套", "女上衣新款", "冰箱", "波西米亚长裙", "儿童自行车", "发饰", "套装 女 夏", "大码女装", "牛仔短裤", "女装小西装", "新款春装", "手表女", "鞋 女 鱼嘴",
         "女休闲裤", "内裤", "小西装女", "长裤女", "母女装", "苹果5s", "中老年服装", "母女亲子装", "打底衫 女", "女内裤", "吊带", "打底衫 女", "衬衫", "欧根纱",
         "平底单鞋", "篮球鞋", "中跟女单鞋", "睡衣", "拉杆箱", "耳机", "套装裙", "旅行箱", "情侣短袖", "沙发", "中老年连衣裙", "婴儿推车", "斜挎包 女", "三星 手机",
         "女真皮包", "婴儿床", "男夹克", "韩国代购", "男装", "蕾丝上衣", "鞋架", "短裤套装", "衬衣 女", "女装牛仔外套", "大码显瘦女装", "时尚女包", "女七分裤", "女鞋 春",
         "礼服", "休闲裤 女", "白衬衫 女", "童装凉鞋", "女双肩包", "凉席", "睡裙", "手表男", "T恤 男", "女晚装礼服", "女装风衣", "大号女装", "泳衣", "地毯",
         "波点衬衫 女", "女钱包", "衣柜", "女装修身裙", "真丝连衣裙", "实木床", "餐桌", "九分裤 女", "玻璃杯", "翡翠", "三星手机", "小手机", "女装", "雨伞", "套装女",
         "男内裤", "长袖连衣裙", "女聚拢文胸", "帐篷", "指甲油", "布艺沙发", "女防水台单鞋", "白色连衣裙", "针织衫 女", "女装毛衣", "笔记本", "牛仔裤女", "背心 女", "斜挎包",
         "沙滩裙", "欧美连衣裙", "行车记录仪", "鱼嘴鞋女", "碎花连衣裙", "水果", "短外套 女", "半身裙 长裙", "耳钉", "休闲裤 男", "毛针织衫", "格子衬衫 女", "手拿包 女",
         "松糕鞋", "运动鞋", "平底凉鞋", "女装小背心", "男裤", "电视", "T恤", "粗跟鞋", "洗衣机", "单肩包 女", "瑜伽服", "开衫 针织衫", "雪纺衬衫", "墙贴", "宽松连衣裙",
         "男短袖衬衫", "春夏连衣裙", "大码连衣裙", "mp3", "连衣裙短袖", "女装半身裙", "妈妈春装", "修身连衣裙", "包包", "鞋 女", "鼠标", "儿童套装", "浅口鞋 女",
         "帆布鞋 女", "华为手机", "新款春装", "男童凉鞋", "实木沙发", "童装裙", "路由器", "童装 女童", "短款外套", "连衣裙 春", "白衬衫女", "蚊帐三开门", "男拖鞋",
         "男女休闲套装", "简易衣柜", "牛仔裤", "牛仔裤", "女装牛仔裤", "连衣裙女新春", "太阳镜", "运动服", "吊带裙", "开衫女", "鱼缸", "空调", "儿童外套", "保温杯",
         "欧美大码女装", "汽车坐垫", "薄外套 女", "平跟女单鞋", "内裤 女", "女春装外套", "背带裤", "春套装", "红色连衣裙", "孕妇装 夏", "布鞋 女", "男装风衣", "太阳镜 女",
         "帆布鞋男", "男士钱包", "风衣外套", "新品单鞋女", "墙纸", "诺基亚", "鱼饵", "无袖连衣裙", "行李箱", "相机", "钱包", "休闲套装 女", "单鞋 女", "连衣裙 新款",
         "女装蕾丝衫", "棉t恤", "低帮鞋", "收纳柜", "折叠自行车", "牛仔裤男", "女士包包", "家居四件套", "平跟单鞋", "松糕凉鞋", "女高跟单鞋", "红米 手机壳", "女士钱包",
         "女童套装", "烧烤炉", "内衣", "雪纺女半身裙", "凉拖", "装饰画", "电饭煲", "七分袖连衣裙", "衣柜", "韩衬衫女", "外套 春", "运动鞋 女", "童装亲子装", "男长袖衬衫",
         "诺基亚手机", "奶瓶", "面条机", "粗跟单鞋", "huawei", "女包 新款", "童鞋", "女装短袖", "中老年上衣", "高跟女凉鞋", "布衣柜", "春装外套女", "高跟鞋 细跟",
         "茶几", "中老年夏装", "包臀裙", "坡跟女单鞋", "榨汁机", "连衣裙 女装", "休闲哈伦裤", "大码女装夏", "u盘", "发箍", "帆布鞋女", "女手包", "女鞋 单鞋", "男表",
         "吊带连衣裙", "情侣睡衣", "八核智能手机", "牛仔外套 女", "键盘", "男装", "豆豆鞋", "情趣内衣", "童装套装", "外套", "沙发", "平跟女凉鞋", "尖头单鞋", "沙发床",
         "电动自行车", "长款t恤", "雪纺衬衫", "妈妈裙", "尖头高跟鞋", "雪纺衫 短袖", "公主裙", "儿童凉鞋", "老人手机", "女装针织衫", "手提包 女", "童裤", "运动鞋 女",
         "家居衣柜", "无线鼠标", "开衫外套", "女春装连衣裙", "收纳盒", "雪纺上衣女", "短外套女", "七分裤 女", "休闲套装夏", "跑步机", "雪纺衫女短袖", "男装西装", "透气男鞋",
         "平底鞋 女", "豆浆机", "双肩包 女", "女手机", "戒指", "鱼嘴高跟鞋", "高帮鞋", "茶具", "山地车", "自行车", "女印花裙", "香水", "欧根纱 上衣", "夏装 女",
         "创意摆件", "情侣装短袖", "华为", "长裙连衣裙", "华为荣耀3c", "女装短外套", "地垫", "短袖运动套装", "女士打底裤", "淑女 连衣裙", "机械表", "新款女装", "大码女鞋",
         "男士休闲鞋", "剃须刀", "饼干", "达芙妮单鞋", "防晒霜", "半袖 女", "皮带", "包臀连衣裙", "粗跟女单鞋", "空调被", "化妆包", "新款女装", "女表", "口红", "雪纺",
         "毛绒玩具", "宽松t恤", "绿茶", "品牌女装", "vivo手机", "裙 夏", "运动休闲套装", "男休闲皮鞋", "打底背心", "明星同款", "桌布", "短袖", "斜跨女包", "4g手机",
         "童装 男童", "九分裤 男", "电视柜", "苹果 4s", "裤子 女", "运动套装 女", "防晒衣 女", "女装背心", "欧洲站连衣裙", "床上四件套", "女婚纱", "七分裤", "运动裤 女",
         "哥弟连衣裙", "人字拖 女", "纽巴伦", "红米 手机套", "红小米手机", "喜糖盒", "童套装", "中老年西装", "情侣装 夏装", "新春连衣裙女", "春秋连衣裙", "帆布鞋", "摆件",
         "包包 女", "挂烫机", "婴儿鞋", "真皮单鞋", "板鞋 男", "高腰短裤", "吊带衫", "亲子装 夏", "女T恤", "白色t恤", "衣架", "粗跟凉鞋", "娃娃", "休闲裤女", "瑜伽垫",
         "女装毛呢外套", "电脑椅", "性感连衣裙", "茶盘", "盆栽", "厚底凉鞋", "遥控飞机", "手包", "韩国 连衣裙", "情侣t恤", "显卡", "雪纺短袖", "女 连衣裙", "雪纺衫上衣",
         "床罩", "花架", "高跟鞋 单鞋", "露肩连衣裙", "浮漂", "哑铃", "晚礼服", "孕妇春装", "男士短袖t恤", "背心女", "花卉", "脱毛膏", "中年女装", "运动鞋", "牛仔衬衫",
         "休闲鞋 女", "巧克力", "男鞋 休闲鞋", "T恤 女", "连衣长裙", "女装", "打底裤女", "台灯", "单鞋 女 春", "女童单鞋", "夹克", "背心裙", "手镯", "皮衣",
         "夹克 男", "大码女装", "甜美连衣裙", "女睡裙", "女运动套装", "夏凉被", "水杯", "htc", "女童春装", "女TX恤", "联想手机", "陀螺", "亲子装 三口", "儿童裙",
         "毛线", "T恤", "女装长裙", "bb霜", "种子", "浴室柜组合", "儿童运动鞋", "儿童皮鞋", "女短靴", "糖果", "孕妇装 春装", "太阳伞", "大码连衣裙", "长袖t恤",
         "女童打底裤", "鱼钩", "头饰", "吊灯", "人字拖", "高腰连衣裙", "女单鞋", "沙滩长裙", "婚纱礼服", "墨镜", "弹力裤", "运动鞋 男", "欧时力", "春秋打底裤", "女装短裤",
         "女t", "淑女装", "哈伦休闲女裤", "眼镜", "纸尿裤", "水杯", "韩版大码女装", "夏装 女", "旗舰店", "开衫针织衫", "伴娘服", "夜店女装", "外套女", "针织开衫女",
         "家居服", "凉拖 女", "文胸 聚拢", "西装外套", "床上用品蚊帐", "羽毛球拍", "夏装 女", "雪纺长裙", "韩版 女装", "短靴", "男鞋 豆豆鞋", "安全裤", "男胸包",
         "女大码雪纺衫", "拖把", "泳衣 女", "定制窗帘", "摩托车整车", "雪纺裙", "花卉 盆栽", "净水器", "连体泳衣", "背心 男", "女式包", "短裤 女", "女真丝连衣裙", "公主裙",
         "小米手机3", "女雪纺裙", "手机壳", "运动裤男", "男童鞋", "鱼嘴高跟鞋", "超高跟女单鞋", "浴室柜", "打火机", "床单", "手提包女", "雪纺衬衫 女", "女装大码", "客厅灯",
         "男士外套", "连身裙 女装", "t恤 女 夏", "皮鞋 男", "打底衫", "高跟鞋 女", "低跟女单鞋", "单肩包", "酷派手机", "雨衣", "背带裙", "套装女装", "短袖女",
         "大码女装外套", "t恤女夏", "耐克 跑步", "发夹", "置物架", "白色打底裤", "短风衣", "凉鞋 鱼嘴", "裙裤", "衬衫 女 韩", "女调整型文胸", "鱼嘴鞋 女", "蕾丝女雪纺衫",
         "半身裙短裙", "厨房置物架", "蛋糕", "情侣装 春装", "布鞋", "肉松饼", "t恤 女", "吸尘器", "帆布鞋 男", "油烟机", "饰品项链", "薄外套", "中袖连衣裙", "二手笔记本",
         "女士单鞋", "牛仔衬衫 女", "假发", "比基尼", "棉麻连衣裙", "tx恤", "孕妇t恤", "亲子装全家装", "压缩袋", "单肩包女", "连衣裙韩国", "外套 女 春", "口罩", "壁纸",
         "音响", "t恤", "秋装连衣裙", "伴娘 礼服", "艺术顶灯", "长袖女雪纺衫", "女靴", "折叠床", "达芙妮", "床垫", "凉拖女", "小脚牛仔裤", "翻盖手机", "敬酒服",
         "短袖t恤", "布料", "苹果5手机壳", "女装春装", "望远镜", "女包 小包", "苹果", "小西装外套", "八核手机", "平板", "男卫衣", "银手镯", "短袖t恤", "发带",
         "夏装 女", "高腰牛仔短裤", "高跟鞋 粗跟", "牛仔裙", "连体裤 夏", "童装", "卫衣", "拖鞋 女 夏", "新款", "T恤 女 夏", "蕾丝背心", "贝壳包", "大码女装",
         "十字绣成品", "索尼手机", "宝宝春装", "情侣鞋", "新娘头饰", "女卫衣/绒衫", "t恤女长袖", "台钓竿", "女鞋 高跟鞋", "中跟女凉鞋", "哈伦裤 男", "枕头", "百丽女鞋",
         "毛呢外套", "女童夏装", "小米2S", "滑板车", "传统糕点", "洞洞鞋", "单肩包男", "春 女鞋", "女三角裤", "女鞋 夏", "运动裤", "水钻凉鞋", "情侣", "小脚裤 女",
         "酸奶机", "儿童连衣裙", "灯具", "男t恤 韩版", "蜂蜜", "防晒衣 长袖", "亲子", "豆豆鞋女", "连体裤 长裤", "恤衫女", "女装", "黑色连衣裙", "中年女装春装",
         "女毛呢外套", "男西装", "被套", "拖鞋", "夏季女装", "斜挎包女", "书柜", "牛仔短裤 女", "尖头平底鞋", "爬行垫", "小披肩", "打底吊带", "男手包", "男裤休闲裤",
         "墨镜 女", "手链 女", "电钻", "步步高手机", "娃娃领连衣裙", "篮球", "绿植盆栽", "半身裙 夏", "卡包", "女童外套", "t恤 男", "春外套", "内裤女", "上衣",
         "雪纺衫 长袖", "手电筒", "茶叶", "女人睡衣", "尖头女单鞋", "女士春单鞋", "洞洞鞋 女", "海竿", "新款春装", "尖头鞋", "女装 夏", "女童装", "三星s5", "板鞋",
         "相框", "挂钟", "皮鞋", "iphone", "莫代尔长裙", "母子装", "羽绒服", "外套", "妈咪包", "休闲装", "白色打底裤", "品牌女装", "长款连衣裙", "水族箱鱼缸",
         "儿童t恤", "花种子", "新款女鞋", "韩版女t恤", "长袖t恤", "短裤 男", "红米手机壳", "白衬衫", "半身裙女", "相册", "女无袖连衣裙", "毛衣", "洗面奶", "针织开衫 女",
         "月子服", "雪纺长袖", "套装", "平底鞋 单鞋", "打底裤 夏", "女装", "孕妇装", "黄金", "欧洲站", "泳衣", "春装", "卧室灯", "面包机", "情趣用品", "电脑",
         "达芙妮凉鞋", "苹果5", "哈伦裤女", "豆豆鞋", "平跟凉鞋", "帽子", "时尚女鞋", "内衣 文胸", "韩版 女装", "牛肉干", "大牌连衣裙", "短袖t", "孕妇", "懒人沙发",
         "休闲套装女", "女牛仔短裤", "运动裤", "背心连衣裙", "纯棉四件套", "女士春装外套", "钓箱", "中长款连衣裙", "沙发套", "苹果 手机", "睡衣夏 女", "蕾丝外套", "马甲 女",
         "广场舞服装", "化妆品", "女装休闲裤", "秋装大码女装", "丝袜 连裤", "新款女装", "照片墙", "韩国东大门", "蓬蓬裙", "隐形文胸", "钥匙扣", "太阳帽", "抹胸", "电磁炉",
         "长款开衫", "木雕", "丝袜 女", "男士长袖t恤", "冲锋衣", "女运动套装", "男士短袖衬衫", "旗袍连衣裙", "女旗袍裙", "船袜", "死飞自行车", "背心", "5s", "红蜻蜓女单鞋",
         "男休闲长裤", "花瓶", "徒步鞋", "男运动休闲鞋", "男跑步鞋", "豆豆鞋男", "三星s4", "女鞋凉鞋", "帆布鞋女鞋", "童装裤", "抱枕", "女装小吊带", "电脑主机", "手机壳",
         "床笠", "小包", "孕妇短裤", "破洞牛仔裤", "男装短袖t恤", "打底连衣裙", "松糕鞋女", "欧根纱", "新款春装", "欧洲站", "女装套装", "女童裤", "迷你手机", "单肩包 男",
         "修身女t恤", "补水面膜", "旗袍裙", "飘窗垫", "豆豆鞋 男鞋", "鱼线", "电热水壶", "家居服 女", "七分裤女", "女款针织衫", "夏季女装", "链条包", "烧烤架",
         "飞利浦剃须刀", "网面运动鞋", "坡跟女鞋", "哈伦牛仔裤女", "男皮带", "男鞋春", "流行男鞋", "中长款 风衣", "镂空针织衫", "小冰箱", "棒球帽", "童鞋 女童", "假两件连衣裙",
         "晾衣架", "中长款女t恤", "女短小外套", "男短裤", "雪纺半身裙", "qq会员", "旅行包", "毛巾", "轮毂", "女长款雪纺衫", "小米2s", "蕾丝打底裤", "短袖女衬衫",
         "太阳眼镜", "真丝上衣", "婚鞋", "夏季情侣装", "收纳盒", "首饰盒", "平底凉鞋 女", "孕妇夏装", "睡衣女夏", "吉他", "遮阳帽", "懒人鞋 女", "衣帽架", "珍珠项链",
         "单鞋 高跟", "高腰牛仔裤", "腰包", "无纺布墙纸", "外套 女", "文胸套装", "苹果手机壳", "水钻单鞋", "情趣丝袜", "钢笔", "门帘", "鲜花种子", "女鞋 高跟鞋", "渔具包",
         "女装春装", "帽子 女", "林弯弯短袖", "卡西欧手表", "整理箱", "格子衬衫", "女装裤", "垃圾桶", "钻石绣", "厚底帆布鞋", "舞蹈鞋", "小礼服", "芦荟胶", "小香风套装",
         "内衣收纳盒", "丝袜 超薄", "儿童爬服", "三星平板电脑", "内裤 男", "意尔康女单鞋", "韩都衣舍", "卷发神器", "裤裙", "打底衫女长袖", "5s手机壳", "耳环", "车贴",
         "电信手机卡", "风筝", "背带裙", "大码雪纺衫", "厚底拖鞋", "长款t恤 女", "情侣衫", "松糕鞋厚底", "儿童床", "单鞋女春", "锁骨链", "真空压缩袋", "男装", "女鞋 平底鞋",
         "短袖套装", "长袖连衣裙女", "钻石画", "蚕丝被", "达芙妮女鞋", "厚底鞋", "2014风衣", "家居十字绣", "梳妆台", "女鞋", "妈妈鞋", "脚垫", "凉拖鞋 女", "女装西装",
         "波点连衣裙", "电风扇", "长款打底衫", "男装T恤", "植物", "两件套长裙", "桑蚕丝连衣裙", "女装连体裤", "婚纱 拖尾", "液晶电视", "配饰项链", "女蕾丝连衣裙", "高跟鞋",
         "新款春装", "男装短袖", "女童裙", "薄款外套女", "男童外套", "男袜", "钥匙包", "钱包女", "蕾丝雪纺衫", "条纹连衣裙", "小米移动电源", "亲子装春装", "二手手机",
         "小米3手机壳", "中老年装", "新款包包", "公路自行车", "七分裤 男", "中长款开衫", "鞋 男", "雨鞋", "咖啡杯", "儿童柠檬杯", "皮床", "印花连衣裙", "春装外套女",
         "男士休闲裤", "摩托车 跑车", "手提包", "男运动套装", "防水台凉鞋", "职业女裙套装", "手机支架", "渔具", "鱼嘴鞋 坡跟", "儿童", "oppo", "华为 手机", "亲子装 母子",
         "女内增高鞋", "浴巾", "长裙 夏", "凉拖鞋", "被子", "女裙", "机顶盒", "4s 手机壳", "收纳袋", "棉麻上衣", "女短袖套装", "孕妇装春装", "十字绣套件", "唐装女上衣",
         "斜跨小包", "长袖运动套装", "一步裙", "背带裤 女", "打底裤女装", "咖啡", "2014婚纱", "洗车水枪", "粉饼", "连体裤 女", "摇摇鞋", "配件", "包臀半身裙", "收纳架",
         "夜店性感", "红枣", "无线网卡", "儿童打底裤", "中兴手机", "女雪纺衫长款", "仿真花", "雪纺背心", "遥控车", "电信智能手机", "女士短裤", "连体短裤", "欧洲站套装",
         "note3", "女连裤袜", "联想笔记本", "红米Note", "高跟鞋凉鞋", "小香风连衣裙", "内增高女鞋", "儿童三轮车", "遮阳伞", "饰品", "手串", "窗帘布", "单靴", "果冻包",
         "跑步鞋 女", "李宁 男鞋", "登山鞋", "宠物狗", "新娘敬酒服", "长袖衬衫", "欧根纱外套", "假睫毛", "女文胸", "童凉鞋", "显示器", "眼影", "船袜 女", "单肩女包",
         "女士凉鞋", "整套茶具", "雪纺衫 女", "水晶灯", "雪纺衫女装", "加大码女装", "铁观音", "半袖 男", "整车", "夏裙", "背包", "短裤 女 夏", "英伦男鞋", "厚底单鞋",
         "灭蚊灯", "盆景", "打底裙", "女装 妈妈装", "led电视", "多肉", "睡衣家居服", "男装休闲长裤", "欧洲站", "帆布包", "娃娃衫", "眼霜", "哺乳衣", "足球鞋", "内增高",
         "裙子", "腰带 女", "休闲哈伦裤女", "zara", "性感睡衣", "布鞋 男", "女雪纺衫", "女上衣", "跑车", "苹果5", "衬衫男男装", "短袖衬衫", "脚链", "女链条包",
         "新款春装", "老北京布鞋", "单反相机", "长款钱包女", "牛仔女装", "电视背景墙", "身体乳", "跳舞毯", "卫衣女", "胸包", "射灯", "针织外套", "袜子", "粉色连衣裙",
         "运动服 女", "蚊帐 蒙古包", "隔尿垫", "男卡套钱包", "坡跟拖鞋", "置物架", "运动套装 女", "大屏手机", "新款女装", "条纹t恤 女", "电子烟", "童鞋 男童", "女雪纺衫",
         "十字绣抱枕", "女装 裤", "防晒帽", "电热水器", "伴娘礼服", "男士t恤", "女 雪纺衫", "夏装 女", "手机套", "置物架", "儿童裙子", "洗脸神器", "西装", "九分牛仔裤",
         "绿植", "棉麻女装", "小脚裤", "童装童鞋", "普洱茶", "女凉鞋 正品", "儿童滑板车", "人字拖 男", "兰花", "哺乳文胸", "oppo手机", "男牛仔长裤", "电水壶", "孕妇上衣",
         "和田玉", "牛仔外套 男", "零食", "孕妇裙 夏", "网络机顶盒", "运动鞋女", "对讲机", "男装", "羽毛球", "女文胸套装", "死飞", "皮衣 女", "马克杯", "男童衬衫",
         "樱桃", "松糕跟女单鞋", "艺术吊灯", "孕妇装夏装", "女装 裤子", "数码相机", "餐边柜", "松糕鞋 女", "零钱包", "炒锅", "中跟单鞋", "女装卫衣", "雪纺短袖 女",
         "风衣 女", "气质连衣裙", "床头柜", "宝宝凉鞋", "女单靴", "新款春装", "防晒服", "智能机", "女装裤", "女衬衫 职业", "真皮女鞋", "懒人鞋", "白色长裙", "长款衬衫",
         "牛仔马甲 女", "功放", "灯饰", "外套", "欧美套装", "女包 大包", "高帮帆布鞋", "尖头鞋 女", "苹果笔记本", "儿童拖鞋", "牛仔背带裤", "女装开衫", "女夏季套装",
         "办公桌", "抱枕", "纯棉睡衣", "女装碎花裙", "越野摩托车", "品牌连衣裙", "女童", "牛仔短裙", "背带裤", "孕妇装 韩版", "发卡", "小米 电视", "马桶", "女旗袍",
         "长袖 连衣裙", "手机卡", "童装", "睡衣女", "睡衣 女 夏", "新款", "韩国套装", "娃娃裙", "lol账号", "杯子", "针织", "夹克 薄 男", "男士内裤", "酷派",
         "女童皮鞋", "女甜美外套", "春夏女装", "新款春装", "无钢圈文胸", "吊带长裙", "学步鞋", "丝袜连裤", "芭比娃娃", "油画", "丝带绣", "大码秋装", "休闲裤男", "女装背带裤",
         "名媛连衣裙", "新品女鞋", "男士运动套装", "拖鞋女夏", "亚麻男裤", "背心长裙", "新款", "银项链", "童床", "松糕单鞋", "超薄 手机", "电饼铛", "茶壶", "小衫",
         "亲子装三口", "蕾丝裙", "儿童雨衣", "两件套裙", "短袖上衣", "情侣夏装", "无痕内衣", "主板", "收音机", "男商务休闲鞋", "床上件套", "水培植物", "中老年外套", "索尼",
         "蚊帐 落地", "春男装外套", "手机保护套", "牛仔半身裙", "女装哈伦裤", "妈妈装 春装", "小脚休闲裤男", "闹钟", "女丁字裤", "皮沙发", "短裤男", "女韩版外套", "女真丝睡衣",
         "丝袜批发", "方便面", "意尔康女鞋", "卓诗尼 单鞋", "家居餐桌", "钱包男", "妈妈装 夏", "积木", "无痕内裤", "袜 女", "短袖连衣裙", "拖鞋 夏", "姐妹装", "儿童帆布鞋",
         "狗窝", "婴儿车", "女帽", "蓝牙", "鸭舌帽 女", "浪莎丝袜", "运动内衣", "防水台单鞋", "透气板鞋", "亚麻女装", "随手杯", "热水器", "皮带 女", "话费充值",
         "薄夹克 男", "学步车", "围裙", "眼镜框", "阔腿裤", "夏季套装", "四核手机", "女夏装连衣裙", "蓝牙音箱", "折叠桌", "男西装", "儿童衬衫", "瑜伽服套装", "小清新连衣裙",
         "真丝睡衣", "剃须刀电动", "新款套装", "电瓶车", "书桌", "夏季女睡衣", "强光手电", "短丝袜", "双肩包女", "复古 连衣裙", "汽车香水", "随身wifi", "男士皮鞋",
         "儿童全家装", "蓬蓬裙 半身", "红蜻蜓女凉鞋", "方向盘套", "花盆 陶瓷", "摩托车头盔", "女童", "大码女装秋装", "白色牛仔裤", "童帽", "韩版女装t恤", "男装春", "平跟女鞋",
         "高低/子母床", "沙滩裤", "地素", "鞋柜住宅家具", "包袋男胸包", "溯溪鞋", "修身女雪纺衫", "普通儿童外套", "保温饭盒", "魔幻陀螺", "男装外套", "皮艺沙发", "短外套春女",
         "夏季连衣裙", "凉鞋 罗马", "春装 女", "女 裤", "玻璃水杯", "女童公主裙", "班服", "拍立得", "女前扣文胸", "q币", "性感内裤", "波西米亚凉鞋", "缝纫机", "牛仔哈伦裤",
         "棉衬衫", "男保罗衫", "诺基亚x", "洗发水", "时尚孕妇装", "风扇", "植物盆栽", "保鲜盒", "魅族mx3", "T恤男", "机箱", "套孕避", "家居鞋柜", "中年连衣裙",
         "花盆陶瓷", "华为P6", "女t恤雪纺", "鱼缸水族箱", "欧洲站女鞋", "布鞋 男", "茶具套装", "包臀短裙", "电子称", "音箱", "篮球服", "水桶包", "苹果4", "女大码连衣裙",
         "鱼嘴", "婴儿衣服", "新款女风衣", "休闲男鞋", "新鲜水果", "手拿包", "连体衣女装", "美白面膜", "摩托车跑车", "宽松t恤 女", "蕾丝衬衫", "单鞋女高跟", "tx恤女",
         "男童套装", "短款t恤", "拖鞋夏", "原宿 t恤", "普洱", "恤衫", "Tx恤", "腰带", "自行车", "达芙妮", "手包女", "双肩包男", "花洒", "套装 夏", "中长款雪纺衫",
         "短袖t恤女", "情侣内裤", "女裙雪紡", "衬衫 男", "蘑菇街 女装", "少女单鞋", "男童t恤", "女衫衣", "女装 裤", "小码女鞋", "翡翠手镯", "春装 连衣裙", "孕妇裤 夏",
         "笔记本散热器", "男装亚麻裤", "夏装套装", "钓鱼", "特大码女装", "春装女连衣裙", "韩版套装", "运动服", "家用跑步机", "坡跟凉拖", "雪纺长裙", "微波炉", "花卉盆栽",
         "男装皮衣", "春秋外套 女", "连衣裙长裙", "米奇t恤", "溜冰鞋", "汽车挂件", "代购连衣裙", "时尚女鞋单鞋", "饮水机", "女童夏装", "面部护理套装", "婴儿哈衣爬服", "魅族",
         "气球", "女童牛仔裤", "男正装凉鞋", "亚麻拖鞋", "大码", "女装连衣", "项链 女", "女款大码女装", "迷你洗衣机", "情侣手表", "裤子", "性感女装", "韩版男鞋", "男平角裤",
         "手抓包 女", "尖头平底单鞋", "学生蚊帐", "监控摄像头", "手机壳保护套", "孕妇装夏", "吊带背心 女", "空气净化器", "瓢鞋", "男童牛仔裤", "货架", "短袖 雪纺", "零食",
         "春装 女", "插座", "宫廷蚊帐", "项链女", "男女帆布鞋", "全棉四套件", "豆豆鞋男鞋", "性感睡衣", "饰品耳环", "书包", "手机包", "薄款打底裤", "大嘴猴t恤", "外套",
         "女真皮衣", "网鞋", "床垫", "女士t恤", "床上套件", "女羽绒服", "坡跟鞋", "长裤 女", "女欧美连衣裙", "机械键盘", "不规则连衣裙", "针织衫女", "打印机", "男士皮带",
         "包裙", "女装吊带衫", "跳绳", "洗车器", "汽车座套", "童装", "长袖 女", "女 西服", "凉鞋", "窗帘成品", "童鞋凉鞋", "显瘦连衣裙", "浴缸", "眼线笔", "鱼护",
         "女中老年t恤", "中长款西装", "泳衣三件套", "打底裤 春秋", "苹果充电宝", "相机包", "移动硬盘", "英伦女鞋", "鱼漂", "储物箱", "拉丁舞鞋", "男装春衬衫", "欧式床",
         "真皮沙发", "卫衣男", "女中老年衬衫", "裤 男", "高跟鞋 夜店", "电压力锅", "胖mm连衣裙", "老年手机", "前扣文胸", "条纹t恤", "太阳镜男", "单鞋女坡跟", "牛仔短裤女",
         "nb 女鞋", "鞋子 男", "水族箱", "毛衣链", "雪纺衫打底衫", "两件套", "九分牛仔裤女", "草帽", "水宝宝", "女帆布包", "裙子夏", "夏季男鞋", "老人机", "高跟女鞋",
         "马卡龙女包", "棒球服 女", "新款女包", "亲子装夏", "运动套装女", "男士手包", "钓鱼椅", "夏装", "内增高女鞋", "帆布鞋", "红婚纱", "刺绣连衣裙", "超薄智能手机",
         "情侣睡衣 夏", "骑行服", "刀剑", "牛仔马甲", "中袖t恤", "宝宝打底裤", "中长款外套", "莫代尔打底裤", "韩版小西装", "燃气灶", "连体衣", "全身镜", "新款凉鞋",
         "老年女装", "墙纸", "真皮女鞋单鞋", "春装新款", "妈妈春装外套", "花卉种子", "浴室拖鞋", "投影机", "沙滩车", "登山包", "毛巾架", "苹果 5s", "汽车座垫", "记录仪",
         "夏季睡衣", "蝴蝶结 单鞋", "单鞋女平底", "蕾丝半身裙", "拉夏贝尔", "旋转拖把", "数据线", "结婚礼物", "头灯", "抹胸连衣裙", "孕妇套装", "母女装夏", "公主女装",
         "男士T恤", "丝巾", "cpu", "女性感连衣裙", "一字领连衣裙", "牛仔短裤 男", "暴龙太阳镜", "套装休闲", "短袖男", "女大杯文胸", "充电宝 包邮", "背带裤 女", "女装",
         "碧根果", "露肩t恤", "睡衣套装", "鱼嘴女单鞋", "大码女装短袖", "布沙发", "男士休闲皮鞋", "三星手机壳", "特产", "中跟女鞋", "水钻女单鞋", "壁灯", "摩托", "婴儿浴盆",
         "短款小西装", "新百伦男鞋", "吹风机", "装饰项链", "客厅吸顶灯", "雪纺女装", "双眼皮贴", "女装旗袍", "苹果", "蚕丝面膜", "座套", "入耳式耳机", "眉笔", "餐具",
         "金丝绒套装", "哈伦女裤", "鞋 女 春季", "半身裙长裙", "自粘墙纸", "大码女装", "喜糖", "七匹狼男t恤", "夏季长裙", "牛仔衣", "女装 夏", "纯银项链", "扭扭车",
         "陀螺 玩具", "韩版外套", "公主连衣裙", "鼠标垫", "休闲连衣裙", "车模", "碎花女连衣裙", "大摆连衣裙", "卫衣", "浴帘", "吊带睡裙", "家庭装", "分体泳衣", "保温壶",
         "斜挎女包", "牛皮女包", "春季连衣裙", "竹席", "平跟单鞋女", "女内衣家居服", "书架", "短女外套春", "职业连衣裙", "老北京布鞋", "钓鱼伞", "蕾丝镂空上衣", "自行车灯",
         "小米 红米", "马赛克", "大 码 女装", "真皮女单鞋", "强光手电筒", "灯具 客厅", "日常休闲男", "红酒", "薄款风衣", "蚊帐/床幔", "四核智能手机", "凉拖鞋", "女装吊带裙",
         "鱼嘴鞋", "格子衬衫女", "仓鼠", "晚装礼服", "蛋卷鞋", "原宿短袖", "白色打底衫", "潮牌t恤", "文玩核桃", "打底裤 原单", "空调罩", "烤箱", "睡衣 男", "露肩",
         "公仔", "男生短袖", "胖大码女装", "娃娃领打底衫", "韩版 女装", "情趣内衣", "雪纺衫衫 女", "妈妈连衣裙", "中年女装夏装", "长袖", "小米红米", "床裙", "男腰包",
         "n字鞋", "蕾丝短袖", "睫毛膏", "钻石十字绣", "春装外套", "小西装 男", "小脚裤 女", "小包包", "男正装皮鞋", "春季孕妇装", "胖妹妹春装", "男童 裤", "女童装",
         "牛仔背带裙", "胸贴", "水晶 手链", "潮男短袖", "童车", "同款连衣裙", "休闲西装 男", "饰品发夹", "皮鞋男", "泡沫地垫", "板鞋 男", "茶叶", "小米3手机套", "汽车用品",
         "单反", "地毯 客厅", "客厅窗帘", "套装 春", "女睡裙", "米3手机壳", "普通坐便器", "u盘16g", "雪纺衬衣", "核桃", "吊床", "中长款外套", "电脑主板", "有线鼠标",
         "夏季女鞋", "石榴石手链", "细跟凉鞋", "家庭影院", "公主鞋", "斗柜", "饭盒", "夏季女装上衣", "香奈儿女包", "春单鞋女", "男士手表", "裤袜", "孕妇哺乳装", "牛仔女装",
         "套装女夏", "新款雪纺衫", "创意礼物", "换鞋凳", "女衬衫 韩", "逆变器", "洗碗机", "袜男", "妈妈夏装", "上衣 女", "塑身衣", "松糕鞋 女鞋", "大嘴猴套装", "鱼嘴单鞋",
         "同学录", "液晶显示器", "钓鱼用品", "耐克男鞋", "蔬果种子", "伴娘裙", "高腰裤", "儿童鞋 女童", "衬衫男", "连衣裙新款", "男衬衣", "大码夏装", "童装女童春装",
         "白色裤子", "上衣 女 夏", "雪纺衬衫 女", "长袖衬衫", "笔袋", "卫衣套装", "皮草", "骆驼男鞋", "时尚女套装", "新娘礼服", "饰品耳钉", "客厅装饰画", "板鞋男", "爽肤水",
         "乐高", "大码女女装", "粗跟女凉鞋", "工作服", "男童装", "欧洲站", "饰品", "松子", "女童春装", "exo", "运动女鞋", "智能手表", "春秋被", "荷叶边连衣裙",
         "男手提包", "汽车脚垫", "棉麻女装", "新生儿礼盒装", "女装长袖t恤", "夹克外套", "布艺床", "松糕拖鞋", "ipad4", "娃娃衫", "金丝肉松饼", "ipad", "中长半身裙",
         "女装吊带", "理发器", "女童公主鞋", "沙发坐垫", "女装打底裤秋", "头盔", "小白鞋", "小脚裤", "哥弟衬衫", "拖鞋 女", "黑色小脚裤", "mk 女包", "长袖女士T恤",
         "女士包", "胖妹妹连衣裙", "婴儿帽", "少女文胸", "细跟单鞋", "收腹内裤", "安卓手机", "裙 连衣裙", "女连衣裙短裙", "屏风", "防晒衫", "白色裤", "长袖T恤女", "紫砂壶",
         "女包新款", "雨伞 折叠", "夏季女装", "中兴", "民族风 女装", "8核智能手机", "内裤女纯棉", "夏装雪纺衫", "收腹带", "移动手机", "新款夏装", "公主童装", "羽毛球鞋",
         "女童公主裙", "呼啦圈", "回力童鞋", "锁骨项链", "森女连衣裙", "网纱女鞋", "卫生巾", "休闲板鞋", "项链黄金", "格子连衣裙", "显瘦", "牛仔衬衫 男", "汽车摆件",
         "名媛套装", "夹脚凉鞋", "童装 男童", "饰品项链 女", "女童裙子", "中袖上衣", "玉镯", "狗笼", "窗帘", "雪纺 女裙", "电脑包", "户外手电筒", "黄色连衣裙", "手竿",
         "无袖雪纺衫", "儿童雨鞋", "甩脂机", "笑脸包", "孕妇内衣", "夹克男", "蒙古包蚊帐", "录音笔", "情侣半袖", "童装裙子", "女装打底裙", "睫毛增长液", "儿童卫衣绒衫",
         "职业装", "格力空调", "特产", "韩国t恤", "化妆品收纳盒", "牛仔背带裙", "亲子装夏装", "无袖上衣", "泳衣", "李宁", "蕾丝雪纺", "平底女鞋", "儿童睡衣", "金丝绒连衣裙",
         "开关", "男人袜", "电动三轮车", "雪纺裤", "西服女", "女项链", "女装 雪纺衫", "打底衫 长袖", "t恤男", "酷派大神F1", "粗跟", "高跟拖鞋", "躺椅", "蚊帐蒙古包",
         "大码连衣裙夏", "扩音器", "防晒手套", "九阳豆浆机", "女大码t恤", "足浴盆", "意尔康女凉鞋", "哺乳衣 外出", "女士鞋", "特百惠", "亚麻裤 男", "鞋垫", "女铆钉靴",
         "天然玉石", "可爱连衣裙", "牛仔女半身裙", "自拍神器", "果树苗", "婴儿背带", "东大门连衣裙", "女童连衣裙夏", "女士春装外套", "尖头女鞋", "瓷砖", "宽松t恤女", "佛珠",
         "迷你包", "连衣裙 雪纺", "豆豆鞋 女鞋", "内增高运动鞋", "纹身贴", "袜子 女", "狗粮", "中老年女衬衫", "大嘴猴", "收腰连衣裙", "高端连衣裙", "娃娃衫", "喜糖盒子",
         "皮肤衣", "蕾丝内裤", "女童t恤", "女装", "现代装饰画", "睡衣女春秋", "沙发垫 布艺", "贝亲奶瓶", "电脑平板", "mp4", "女装新款", "雪纺连衣裙女", "九分哈伦裤",
         "创意礼品", "壁纸", "迷彩服", "春装外套", "女鞋高跟鞋", "背心", "电子琴", "沙发巾", "男帽", "运动装套装", "浪莎连裤袜", "雪纺短袖上衣", "外贸原单女装", "睡衣 夏",
         "戒指 女", "小叶紫檀", "完美芦荟胶", "情侣手链", "春秋外套", "餐厅灯", "新款夏装", "休闲鞋 女", "娃娃领雪纺衫", "2014女鞋", "女长裙", "金立手机", "牛仔裙",
         "韩国柠檬杯", "男童网鞋", "厚底松糕", "睡袋", "运动服 男", "帆布鞋 松糕", "蕾丝短裤", "唇膏", "夏季女装", "碎花裙", "真丝 衬衫", "女生短袖", "家居电视柜", "地板革",
         "淑女连衣裙", "松糕凉拖鞋", "收纳箱 塑料", "欧洲站 新款", "夏装", "键盘鼠标套装", "蚊帐 三开门", "女包包", "戴妃包", "家居沙发垫", "职业装 女装", "男童短袖", "短婚纱",
         "乒乓球拍", "高腰半身裙", "连体衣", "运动休闲鞋", "休闲皮鞋", "雪纺套装", "百丽单鞋", "男船袜", "女包 单肩包", "空调衫", "真皮凉鞋", "加湿器", "欧洲站短袖",
         "棒球帽 女", "胸针", "短裤热裤", "t恤女短袖", "高帮女帆布鞋", "钢琴", "汽车用品", "夹克衫 男装", "新娘婚纱", "女鞋春", "电话机", "酒柜", "手工皂", "篮球鞋 男",
         "蕾丝长裙", "女装", "溜冰鞋儿童", "防尘塞", "韩国运动套装", "运动鞋 男", "迷你音响", "游泳池", "养生壶", "紫色 连衣裙", "牛排", "夏情侣装", "男装牛仔长裤",
         "衬衣女 长袖", "中跟凉鞋", "沙滩裤 男", "三星n900", "春秋外套 女", "夏装上衣", "新款春装", "仓鼠笼", "韩版项链", "三星手机套", "短裤 夏 女", "长连衣裙", "浴霸",
         "内衣套装", "吧台", "铅笔裤 女", "2014", "瓷砖", "男童夏装", "大码女裤", "男风衣", "哈伦", "红色礼服", "大码女凉鞋", "创意", "摄像机", "撞色连衣裙",
         "ol连衣裙", "雪纺连衣长裙", "运动裤女", "靠垫", "家居拖鞋", "国画", "短款钱包女", "多肉花盆", "背心裙连衣裙", "双肩包 男", "耳机 头戴式", "男童裤子", "纸巾盒",
         "绿色连衣裙", "加大码连衣裙", "led灯", "休闲套装", "亲子装 母女", "蓬蓬连衣裙", "打底裤外穿", "棉麻衬衫", "石英表", "女T", "运动装", "女装春装", "u盘8g",
         "披肩", "儿童运动套装", "连体裤夏", "红米手机皮套", "童裙", "帆布鞋女", "哈伦牛仔女裤", "强效减肥", "开关贴", "奶粉", "女高帮鞋", "挂脖连衣裙", "婴儿连体衣", "护肤品",
         "男项链", "特百惠水杯", "蜜蜡", "男韩版短袖", "套裙", "优雅连衣裙", "短裙 夏", "拖鞋 男", "露肩 上衣", "男童春装", "三星智能手机", "茶杯", "休闲鞋 男鞋",
         "镂空连衣裙", "牛仔衣 女", "小脚铅笔裤", "古装", "玫瑰花茶", "英雄联盟", "沙滩裙 长裙", "碧玺手链", "太极服", "投影仪", "内衣文胸", "孕妇托腹裤", "按摩椅",
         "针织衫外套", "休闲女裤", "女装连身裙", "花盆包邮", "无袖雪纺", "性感睡衣 女", "夏威夷果", "项坠/吊坠", "蕾丝吊带背心", "蕾丝吊带", "上下床", "明星同款套装", "收纳袋",
         "枕芯", "低跟单鞋", "纽巴伦女鞋", "卧室台灯", "现代和田玉", "十字绣 新款", "男士休闲鞋", "女装 大码", "电吹风", "鱼缸过滤器", "女裤 长裤", "套装 运动", "葡萄干",
         "夏装 男", "儿童玩具", "零食", "2014女装", "低音炮", "雪纺开衫", "外贸连衣裙", "运动裤男", "台式电脑桌", "菩提子", "硬盘播放器", "长款风衣", "雪纺半身长裙",
         "料理机", "婴儿游泳池", "裙子夏连衣裙", "男士休闲长裤", "男凉拖", "男装裤休闲裤", "中长款女西装", "长款短袖", "女风衣外套", "美甲套装", "孕妇装上衣", "背心/吊带女",
         "树苗", "银手链", "卡西欧", "坡跟鞋", "中袖雪纺衫", "女鞋 短靴", "开关", "晚装", "女高帮鞋", "秋水伊人", ]

